---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayIterator.#ctor
source: html/81fd3daf-ab3d-ae8b-d753-b0d377f64dd5.htm
---
# Autodesk.Revit.DB.ReferenceArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ReferenceArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.